Revit 2027 API
BuiltInFailures.StairRampFailures.InvalidParameters Property
 Stairs run or landing has invalid parameter(s).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidParameters { get; }
Public Shared ReadOnly Property InvalidParameters As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidParameters {
	FailureDefinitionId^ get ();
}
static member InvalidParameters : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace